# GetExternalResourceReference Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadData..::..GetExternalResourceReference Method
ExternalResourceLoadData Class See Also
---
Returns the ExternalResourceReference that identifies which resource should be loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceReference GetExternalResourceReference()
```

Visual Basic
---
```text
Public Function GetExternalResourceReference As ExternalResourceReference
```

Visual C++
---
```text
public:
ExternalResourceReference^ GetExternalResourceReference()
```

# Remarks
Information in this object tells the server from which specific resource Revit expects to receive the external data.
# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace